app/controllers/store_controller.rb

  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO "line_items" ("updated_at", "total_price", "order_id", "quantity", "product_id", "created_at") VALUES('2012-09-19 13:51:55', 29.95, 5, 1, 4, '2012-09-19 13:51:55')
INSERT INTO "orders" ("created_at", "address", "pay_type", "updated_at", "name", "email") VALUES('2012-09-16 13:57:48', 'pune', 'po', '2012-09-16 13:57:48', 'bhargav', 'bhargav@gmail.com')