app/controllers/users_controller.rb

  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 8) LIMIT 1
DELETE FROM "users" WHERE "id" = 2